#include <stdio.h>

int main_mul_array(void)
{
	// 다차원 배열 multidimensional array
	int i; // □
	int ar[5]; // □□□□□ [0][1][2][3][4]
	int ar2[2][5];
	// □□□□□ 5개짜리가
	// □□□□□ 2개인 배열 (2차원 배열)
	// [0,0][0,1][0,2][0,3][0,4]
	// [1,0][1,1][1,2][1,3][1,4]

	// 접근할때 [1,3] --> arr2[1][3]으로 접근
	// 설명 편의를 위해 콤마로 표시

	int ar3[3][2];
	// □□ 2개짜리가
	// □□ 3개인
	// □□ 배열
	// [0,0][0,1]
	// [1,0][1,1]
	// [2,0][2,1]

	int ar4[3][2][2]; // 3차원 배열
	// 2개짜리가 2개인 3개
	// □□ □□ □□
	// □□ □□ □□
	// [0,0,0][0,0,1] [1,0,0][1,0,1] [2,0,0][2,0,1]
	// [0,1,0][0,1,1] [1,1,0][1,1,1] [2,1,0][2,1,1]

	// 선언하는 방법
	int arr[5] = { 1,2,3,4,5 };
	int arr2[2][5] = {
		{ 1, 2, 3, 4, 5 },
		{ 6, 7, 8, 9, 10 }
	};
	int arr3[3][2] = {
		{ 1, 2 },
		{ 5, 6 },
		{ 9, 10 }
	};
	int arr4[3][3][3] = {
		{
		{1,2,3},
		{4,5,6},
		{7,8,9}
		}, // 이런식으로 하면 이해 빠르게(꼭 엔터 안쳐도됨)
		{{11,12,13}, {14,15,16}, {17,18,19}},
		{{21,22,23}, {24,25,26}, {27,28,29}} };

	printf("\n2차원 배열\n");
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 2; j++)
		{
			printf("2차원 배열 (%d, %d)값은 %d\n", i, j, arr3[i][j]);
		}
		printf("\n");
	}

	printf("\n3차원 배열\n");
	for (int i = 0; i < 3; i++)
	{
		for (int j = 0; j < 3; j++)
		{
			for (int k = 0; k < 3; k++)
			{
				printf("3차원 배열 (%d, %d, %d)값은 %d\n",
					i, j, k, arr4[i][j][k]);
			}
			printf("\n");
		}
		printf("\n");
	}
	return 0;
}
