# 빈 자리는 빈공간으로 두고, 오른정렬하되(>) 총 10자리 공간을 확보
print("{: >10}".format(500)) # {:시작 :빈공간한칸 >:우정렬 10:10칸 }
print("{0: >10}".format(500)) # 이때 0은 포맷용(500불러오기)
print("{0:0>10}".format(500)) # 0으로 채우기
print("{0: >+10}".format(500)) # 부호
print("{0: >+10}".format(-500))
print("{0:_<10}".format(500)) # 왼쪽정렬
print("{0:,}".format(10000000)) # 3자리마다 콤마
print("{0:+,}".format(10000000))
print("{0:^>+30,}".format(10000000)) # 채움,정렬,부호여부,자리,콤마
print("{0:f}".format(5/3)) # 소수점 출력
print("{0:.2f}".format(5/3)) # 소수점 두번째자리까지만